:CHATSERVER
{	
	BindIP = "0.0.0.0"		// bind IP
	Port = 11903		// Port	
	CreateWorker = 4		// 생성 워커 스레드
	ActiveWorker = 2		// 활성화 워커스레드
	CreateAccept = 1		// 생성 엑셉트 스레드
	HeadCode = 119		// 헤더 코드
	XorCode = 50		// XorCode 1번
	Nodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
	MaxJoinUser = 4000	// 최대 접속 가능 유저 수
	LogLevel	= 0		// 0 : 디버그 / 1 : 위험 / 2 : 에러 / 3 :  시스템
	HeartBeat	= 0	// 하트비트 체크 여부. 0이면 체크, 1이면 체크 안함
}

:CONFIG
{
	ChatIP = "192.168.10.119"	// 배틀서버에 전달하는, 채팅서버의 IP. 유저들은 이 정보를 보고 들어온다.
}

:CHATLANCLIENT
{
	BattleServerIP = "10.0.0.2"	// 배틀 Lan 서버의 IP
	BattleServerPort = 13200	// 배틀 Lan 서버의 Port
	ClientCreateWorker = 1	// 생성 워커 스레드 
	ClientActiveWorker = 1	// 활성화 워커 스레드
	ClientNodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
}

:MONITORLANCLIENT
{
	MonitorServerIP = "222.107.0.122"	// 전달을 위한 모니터링 서버(LanServer)의 IP
	MonitorServerPort = 20050		// 전달을 위한 모니터링 서버(LanServer) Port
	MonitorClientCreateWorker = 1	// 생성 워커 스레드 
	MonitorClientActiveWorker = 1	// 활성화 워커 스레드
	MonitorClientNodelay = 0		// Nodelay. 1이면 노딜레이 옵션 적용(네이글 알고리즘 적용)
}
